#!/user/bin/env python3
# -*- coding: utf-8 -*-
#--------------输入输出case 1-----------------------
# print('input u name')
# name=input()
# print('hello,world',name)

#--------------输入输出case 2-----------------------
# name=input('input u name:')
# print('hello,world',name)

#--------------输入输出case 3-----------------------
# print('1024*768=',1024*768)


#--------------缩进代码块case 1-----------------------
# a=100
# if a>100:
# 	print(a)
# else:
# 	print(100-a)

#--------------数据类型 case 1 -----------------------
# 整数和浮点数在计算机内部存储的方式是不同的，整数运算永远是精确的（除法难道也是精确的？是的！），而浮点数运算则可能会有四舍五入的误差。
# a=100
# b=0xff00
# c=0.11113324141233123123
# d=1.2345e13
# e=12.345e11
# print('十进制：100 :',a)
# print('十六进制：0xff00 :',b)
# print('浮点数：0.11113324141233123123 :',c)
# print('科学计数浮点数：1.2345e12 :',d)
# print('科学计数浮点数：12.345e11 :',e)

#-------------- 数据类型 case 2 -----------------------
# a='I\'m \"Ok\"!'
# b='i\'m learning\nPython \t \\aaa\\\n\\'
# print(a)
# print(b)
# print(r'\\\n')
# print(r'\\\n','''asdasd
# aaaaa
# 	bbbbb
# 		ccccc''')
#-------------- 数据类型 case 3  -----------------------
# print(True)
# print(False)
# print(1>2)
# print(3<4)
# a=10<3
# b=1<2
# print(a and b)
# print(a or b)
# print(not b)
# print('0 is None?',0==None)

#-------------- 数据类型 case 4 -----------------------
# print('10/3 : ',10/3)
# print('10//3 : ',10//3)
# print('10%3 : ',10%3)

#-------------- 编码 case 1 -----------------------
# print('我有一只小毛驴，我从来也不骑。。aaa')
# a=ord('a')
# b=ord('有')
# c=chr(64)
# d=chr(21957)
# e=b'aaadds'
# f='aaadds'
# print(a)
# print(b)
# print(c)
# print(d)
# print('e',e)
# print('f',f)
# print('f.encode(\'ascii\')==e',(f.encode('ascii'))==e)
#-------------- 编码 case 2  -----------------------
# print('len(\'ABC\')',len('ABC'))
# print('len(\'嵘\')',len('嵘'))
# a='嵘'.encode('utf-8')
# print('\'嵘\'.encode(\'utf-8\')',a)
# b=a.decode('utf-8')
# print(a,'.decode(\'utf-8\')',b)

#-------------- 格式化 case 1 -----------------------
# a='hello,%s' % 'asdasdsad'
# b='hello,%s and %s and %s ' % ('众','划','算')
# c='growth rate is %d %%' %(25)
# print(a)
# print(b)
# print(c)
#-------------- list case 1 -----------------------
# classmate=['aa','bb','cc']
# print(classmate)
# print(len(classmate))
# print(classmate[0])
# print(classmate[1])
# print(classmate[2])
# print(classmate[-1])
# print(classmate[-2])
# print(classmate[-3])
# classmate.append('Adam')
# print(classmate)
# classmate.insert(2,'Monk')
# print(classmate)
# classmate.pop()
# print(classmate)
# classmate.pop(2)
# print(classmate)
# classmate[2]='Asdsf'
# print(classmate)
# classmate.insert(1,['rr',123,b'asd'])
# print(classmate)
# print(classmate[1][1])

#-------------- tuple case 1  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------
#-------------- case  -----------------------